CFDSimulationOfFlowInAnElbowUsingOpenFoam/Glycerin/V=5.3_P=1atm/case1_6C_0-700_WI5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         700;

deltaT          1;

writeControl    timeStep;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions 
{ 
    #includeFunc  flowRatePatch(name=Inlet)
    #includeFunc  flowRatePatch(name=Outlet)
    #includeFunc  solverInfo


    pressure
    {
        // Mandatory entries (unmodifiable)
        type            pressure;
        libs            (fieldFunctionObjects);

        // Mandatory entries (runtime modifiable)
        mode            total;

        // Optional entries (runtime modifiable)
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf          1261.0; // enabled if rho=rhoInf
        pRef            0.0;
        hydroStaticMode none;
        g               (0 -9.81 0); // enabled if hydroStaticMode != none
        hRef            0.0;         // enabled if hydroStaticMode != none
        pInf            0.0;
        UInf            (1 0 0);
        
        writeControl    timeStep;
        writeInterval   5;

    }


}

// ************************************************************************* //
